Repository: leoguimaoficial/NVDA-SpeedTest
Catalog: addon/locale/*/LC_MESSAGES/nvda.po
Languages: es, fr, it

source: • Server: {name} – {location} (ID {id})
es: • Servidor: {name} – {location} (ID {id})
fr: • Serveur : {name} – {location} (ID {id})

source: • Jitter: {jitter:.2f} ms
fr: • Gigue : {jitter:.2f} ms

source: • Packet loss: {ploss:.0%}
es: • Pérdida de paquetes: {ploss:.0%}
fr: • Perte de paquets : {ploss:.0%}
it: • Perdita di pacchetti: {ploss:.0%}

source: • Download: {d_mbps:.2f} Mbps ({d_mb:.0f} MB in {d_sec:.1f} s)
es: • Descarga: {d_mbps:.2f} Mbps ({d_mb:.0f} MB en {d_sec:.1f} s)
fr: • Téléchargement : {d_mbps:.2f} Mbps ({d_mb:.0f} MB en {d_sec:.1f} s)

source: • Upload: {u_mbps:.2f} Mbps ({u_mb:.0f} MB in {u_sec:.1f} s)
es: • Subida: {u_mbps:.2f} Mbps ({u_mb:.0f} MB en {u_sec:.1f} s)
fr: • Envoi : {u_mbps:.2f} Mbps ({u_mb:.0f} MB en {u_sec:.1f} s)

source: • ISP: {isp}
fr: • FAI : {isp}

source: • External IP: {ip}
es: • IP externa: {ip}
fr: • IP externe : {ip}
it: • IP esterno: {ip}

source: • Internal IP: {ip}
es: • IP interna: {ip}
fr: • IP interne : {ip}
it: • IP interno: {ip}

source: Error formatting details
es: Error al formatear los detalles
fr: Erreur lors du formatage des détails
it: Errore nella formattazione dei dettagli

source: speedtest.exe not found in the add-on folder.
es: speedtest.exe no se encontró en la carpeta del complemento.
fr: speedtest.exe non trouvé dans le dossier du module complémentaire.
it: speedtest.exe non trovato nella cartella del componente aggiuntivo.

source: Failed to run speedtest.exe
es: Fallo al ejecutar speedtest.exe
fr: Échec de l'exécution de speedtest.exe
it: Impossibile eseguire speedtest.exe

source: Test details
es: Detalles de la prueba
fr: Détails du test
it: Dettagli del test

source: Open in browser
es: Abrir en el navegador
fr: Ouvrir dans le navigateur
it: Apri nel browser

source: Back
es: Volver
fr: Retour
it: Indietro

source: Click Start to measure your connection.
es: Haz clic en Iniciar para medir tu conexión.
fr: Cliquez sur Démarrer pour tester votre connexion.
it: Fai clic su Avvia per testare la tua connessione.

source: &Start test
es: &Iniciar prueba
fr: &Démarrer le test
it: &Avvia test

source: History
es: Historial
fr: Historique
it: Cronologia

source: &View details
es: &Ver detalles
fr: &Voir les détails
it: &Visualizza dettagli

source: &Delete
es: &Eliminar
fr: &Supprimer
it: &Elimina

source: &Clear history
es: &Borrar historial
fr: &Effacer l'historique
it: &Cancella cronologia

source: &Close
es: &Cerrar
fr: &Fermer
it: &Chiudi

source: History:
es: Historial:
fr: Historique :
it: Cronologia:

source: This test uses Ookla's Speedtest CLI. By proceeding, you agree to the Terms. Continue?
es: Esta prueba usa el Speedtest CLI de Ookla. Al continuar, aceptas los Términos. ¿Deseas continuar?
fr: Ce test utilise Speedtest CLI d'Ookla. En continuant, vous acceptez les conditions. Continuer ?
it: Questo test utilizza Speedtest CLI di Ookla. Procedendo, accetti i Termini. Continuare?

source: Accept terms
es: Aceptar términos
fr: Accepter les conditions
it: Accetta i termini

source: Cancel
es: Cancelar
fr: Annuler
it: Annulla

source: Testing... Please wait.
es: Probando... Por favor, espera.
fr: Test en cours... Veuillez patienter.
it: Test in corso... Attendere prego.

source: Start test
es: Iniciar prueba
fr: Démarrer le test
it: Avvia test

source: Test canceled or failed.
es: Prueba cancelada o fallida.
fr: Test annulé ou échoué.
it: Test annullato o non riuscito.

source: Ping: {ping} ms Download: {down} Mbps Upload: {up} Mbps
es: Ping: {ping} ms Descarga: {down} Mbps Subida: {up} Mbps
fr: Ping : {ping} ms Téléchargement : {down} Mbps Envoi : {up} Mbps

source: SpeedTest result
es: Resultado de SpeedTest
fr: Résultat SpeedTest
it: Risultato SpeedTest

source: Error: {err}
fr: Erreur : {err}
it: Errore: {err}

source: Are you sure you want to delete this test?
es: ¿Estás seguro de que deseas eliminar esta prueba?
fr: Voulez-vous vraiment supprimer ce test ?
it: Sei sicuro di voler eliminare questo test?

source: Confirm delete
es: Confirmar eliminación
fr: Confirmer la suppression
it: Conferma eliminazione

source: Are you sure you want to clear all history?
es: ¿Estás seguro de que deseas borrar todo el historial?
fr: Voulez-vous vraiment effacer tout l'historique ?
it: Sei sicuro di voler cancellare tutta la cronologia?

source: Clear history
es: Borrar historial
fr: Effacer l'historique
it: Cancella cronologia

source: Opens the NVDA Speedtest dialog.
es: Abre el diálogo de prueba de velocidad de NVDA.
fr: Ouvre la fenêtre de dialogue NVDA Speedtest.
it: Apre la finestra di dialogo di NVDA Speedtest.

source: Run accessible internet speed tests (download, upload, ping) directly from NVDA. Friendly interface, spoken results, integrated history and multi-language support.
es: Realiza pruebas de velocidad de Internet accesibles (descarga, subida, ping) directamente desde NVDA. Interfaz amigable, resultados hablados, historial integrado y soporte multilingüe.
fr: Effectuez des tests de vitesse Internet accessibles (téléchargement, envoi, ping) directement depuis NVDA. Interface conviviale, résultats vocalisés, historique intégré et prise en charge multilingue.
it: Esegui test di velocità Internet accessibili (download, upload, ping) direttamente da NVDA. Interfaccia intuitiva, risultati vocali, cronologia integrata e supporto multilingue.

source: Copy selected item
es: Copiar elemento seleccionado
fr: Copier l'élément sélectionné
it: Copia elemento selezionato

source: Please select an item to copy.
es: Por favor, selecciona un elemento para copiar.
fr: Veuillez sélectionner un élément à copier.
it: Seleziona un elemento da copiare.

source: No item selected
es: Ningún elemento seleccionado
fr: Aucun élément sélectionné
it: Nessun elemento selezionato

source: Copied to clipboard.
es: Copiado al portapapeles.
fr: Copié dans le presse-papiers.
it: Copiato negli appunti.

source: Success
es: Éxito
fr: Succès
it: Successo

source: Failed to open clipboard.
es: No se pudo abrir el portapapeles.
fr: Échec de l'ouverture du presse-papiers.
it: Impossibile accedere agli appunti.

source: Error
fr: Erreur
it: Errore

source: Test result details
es: Detalles del resultado de la prueba
fr: Détails du résultat du test
it: Dettagli del risultato del test

source: Internet Speed Test
es: Prueba de velocidad de Internet

source: No tests found.
it: Nessun test trovato.
